{
	"publisher_id": 0,
	"publisher_package_id": 1058,
	"title": "UnityCar",
	"description": "<strong>UnityCar</strong> is a realistic and complete <strong>vehicle simulation package</strong> for Unity3D Game Engine.\nYou can integrate (without scripting) any kind of vehicle in your game: <strong>passenger cars, racing cars, dragsters, drift cars, trucks (with trailer)</strong>.<br>\n<br>\nFeatures:<br>\n<strong>- Very easy to setup</strong> just click on \"UnityCar\" menu voice under Component/Physics menu and you are ready to drive;<br>\n<strong>- Optimized code</strong> suitable for mobile system like <strong>iphone</strong > or <strong >ipad</strong>;<br>\n<strong>- Customizable</strong> in every aspect of the vehicle;<br>\n<strong>- 9 fully functional vehicle prefabs</strong> included;<br>\n<strong>- Extensive <a href=\"http://unitypackages.net/unitycar/wiki/\">wiki documentation</a></strong>;<br>\n<strong>- New 1.2 version</strong>.\n<br><br>\nTry the <a href=\"http://unitypackages.net/unitycar/\">live demo</a>!",
	"changes": "1.2\nUpdates:\n- all unused vars has been deleted in order to make the package warning free;\n- added abstract controller: now you can add any kind of script controller without having to modify the main (abstract) class. Included controller are: axis controller (for keyboard and wheel/joystick), mouse controller, mobile (iphone and android touchscreen and accelerometer) controller;\n- axis controller now is compatible with multi-axis driving wheel like Logitech G25 or G27;\n- some further code optimizations;\n- all the package code has been moved inside a folder called UnityCar in order to avoid messing with your project during import (thanks to azeitler for the suggetion);\n- added new feature: physic material simulation. Now you can have different vehicle behaviour (grip, rolling friction, static friction, dynamic friction) on different material. Included physic material: track, grass, sand, off road. You can add unlimited type of material;\n- added new class: physicmaterials. In this class you can put the materials you use in your terrain, with relative physical parameters (which are different from material one). These parameters are:[/B] grip, rolling friction, static friction, dynamic friction.\n- improved arcade mode;\n- added a new parameter in cardynamics class: targetPlatform. With this parameter you can choose two different level of simulation accuracy: optimized for mobile devices and optimized for best simulation accuracy;\n- added a new parameter in cardynamics class: controller. Used to change the controller used to control this vehicle. Possible values are: Axis (keyboard and wheel/joystick), Mouse, Mobile (iphone and android touchscreen and accelerometer), None;\n- added a new parameter in cardynamics class: frontRearBrakeBalance. Used to change the brake balance between front and rear;\n- setup parmeter in cardynamics class is now a combo box;\n- tires parmeter in cardynamics class is now a combo box;\n- added a new parameter in cardynamics class: air density;\n- added a new parameter in cardynamics: disableAllGUI (used to to toggle all GUIs and all keys input in one time);\n- added a new parameter in carcontroller: enableKeys. Used to enable / disable non control related keys like toggle ABS, toggle TCS, change transmission etc.\n- added a new parameter in carcontroller: smoothInput. Used to toggle input values smoothing (used for digital input like keyboard, but unuseful for analog input like steering wheels).\n- added a new parameter in carcontroller: TCSMinVelocity. Used to set minimum velocity at which TCS is triggered.\n- added a new parameter in carcontroller: ABSMinVelocity. Used to set minimum velocity at which ABS is triggered.\n- added a new parameter in carcontroller: ESPMinVelocity. Used to set minimum velocity at which ESP is triggered.\n- improved TCS behaviour: now car doesn't slow down in curves with TCS on (thanks to grfxman for the suggestion);\n- improved ABS behaviour: now if one wheel is locked, ABS doesn't cut brakes on all other wheels.\n- added three new parameters in soundcontroller class: rollingNoiseGrass, rollingNoiseSand, rollingnoiseOffRoad. Used to reproduce the rolling noise on different surface (grass, sand, off road);\n- some updates and corrections in the wiki documentation (http://www.unitypackages.net/unitycar/wiki)\n- improved automatic transmission: if speed < 10 km/h shifts directly to the first gear;\n- improved clutch: starts are smoother now;\n- improved 3D tire: now the tire is simulated as a full spring and damper system with optional tire deformation;\n- added a new parameter in wheel class: rimRadius. This is the radius of the wheel without the tire. Used in tire deformation in order to avoid to deform the tire more than physical possible;\n- new domain and new website: http://www.unitypackages.net/unitycar\n- fully compatible with Pro Racing AI package.\n \n- added a new scene: Monza track, a full featured monza track build with GPS data. Thanks to Sipon for this;\n- added a new scene: Rally Sweden, a simple rally terrain;\n\n\nFixes:\n- fixed the error of cardamage script that cause sporadic weird car damages;\n- fixed subtle sliding of the car on a ascent with brakes on;\n\n\n\n1.1\nUpdates:\nadded a new optional ArcadeMode;\nnow the wing class calculates correclty not only the downforce but also the drag of the wing;\nnow in the wing class is possible to specify not only the drag coefficent of the wing, but also the angle of attack and the area; thanks to David for this;\nimproved suspension bump stop behaviour;\nimproved managing of cars with more than 4 wheels;\nadded YforceDamp in the cardamage class; its used to damp the strenght of collisions in vertical direction, low values will save the car from severe damages after jumps;\nfixed an error in the rev limiter code;\nadded diesel engine curve torque: now is possible to choose between petrol engine curve torque and diesel engine curve torque;\nnow is possible to use more than one reverse gear;\nadded a new parameter in DriveTrain class: engage Speed (how much time is used to engage the clutch), useful for heavy vehicle like trucks which need more time to engage the clutch effectifely;\nadded a new parameter in DriveTrain class: clutch Threshold (used to check if the clutch is fully engaged), useful to obtain smooter starts and to avoid unwanted clutch slipping;\nadded a new parameter in CarDynamics class: tires (here you can specify tires setup);\n\nadded a new car (ferrari like)\nadded a new car (moon buggy, 6 wheels car)\nadded a new car (truck with trailer)\n\nFixes:\nfixed the wrong dependency in CarController class: now you can create or import a car without the need to import the CarCameras class too; thanks to Emerson for this.\n",
	"version_name": "1.204",
	"category": 3,
	"price": "150",
	"recommended_features": [],
	"required_features": []
}
